
from .base_event import BaseEvent

class PasswordResetRequestEvent(BaseEvent):
    """
    Подія, що виникає при запиті користувача на скидання пароля.
    Ця подія зазвичай споживається сервісом сповіщень для надсилання email з інструкціями.
    """

    # Тип події для ідентифікації та маршрутизації в системі обміну повідомленнями
    event_type: str = "password_reset_requested"

    # Email адреса, на яку буде надіслано лист для відновлення
    email: str

    # Секретний токен, який використовується для валідації запиту при зміні пароля
    reset_token: str

    # Унікальний ідентифікатор користувача в системі
    user_id: str
