
from .base_event import BaseEvent

class UserRegisteredEvent(BaseEvent):
    """
    Подія, що публікується в шину повідомлень при успішній реєстрації нового користувача.
    Використовується для синхронізації даних між мікросервісами (наприклад, для надсилання вітального листа).
    """

    # Константне значення для ідентифікації типу події в системі обміну повідомленнями
    event_type: str = "user_registered"
    # Email адреса користувача, на яку було створено акаунт
    email: str
    # Унікальний ідентифікатор користувача в базі даних
    user_id: str